Ran Plan for dir: `demo/8-eks-a` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.alb: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.alb: Read complete after 2s
data.aws_subnets.a: Reading...
module.monitoring-v1.data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_group.master[0]: Reading...
module.eks.data.aws_region.current: Reading...
data.aws_subnets.c: Reading...
module.workers-v1.data.aws_ssm_parameter.docker_config: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_subnets.a: Read complete after 0s [id=ap-northeast-2]
data.aws_subnets.b: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.workers-v1.data.aws_caller_identity.current: Reading...
module.monitoring-v1.data.aws_ssm_parameter.docker_config: Reading...
data.aws_subnets.c: Read complete after 0s [id=ap-northeast-2]
module.irsa["aws-ebs-csi-driver"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node-termination-handler"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.monitoring-v1.data.aws_ssm_parameter.docker_config: Read complete after 0s [id=/k8s/common/docker-config]
module.irsa["aws-load-balancer-controller"].data.aws_caller_identity.current: Reading...
module.monitoring-v1.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-node"].data.aws_caller_identity.current: Reading...
data.aws_subnets.b: Read complete after 0s [id=ap-northeast-2]
module.workers-v1.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-ebs-csi-driver"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["kubecost"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node-termination-handler"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["external-dns"].data.aws_caller_identity.current: Reading...
module.irsa["aws-ebs-csi-driver-sa"].data.aws_caller_identity.current: Reading...
module.irsa["aws-efs-csi-driver"].data.aws_caller_identity.current: Reading...
module.irsa["cluster-autoscaler"].data.aws_caller_identity.current: Reading...
module.irsa["karpenter"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.workers-v1.data.aws_ssm_parameter.docker_config: Read complete after 0s [id=/k8s/common/docker-config]
module.irsa["external-dns"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-load-balancer-controller"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["external-secrets"].data.aws_caller_identity.current: Reading...
module.irsa["aws-ebs-csi-driver-sa"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["kubecost"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-efs-csi-driver"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["external-secrets"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["cluster-autoscaler"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.eks.data.aws_iam_group.master[0]: Read complete after 1s [id=AGPARGS2NKBQ5AE36UBZS]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ssm_parameter.cluster_oidc_url will be created
+ resource "aws_ssm_parameter" "cluster_oidc_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s/common/eks-demo-a/cluster_oidc_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_role_name will be created
+ resource "aws_ssm_parameter" "cluster_role_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s/common/eks-demo-a/cluster_role_name"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_version will be created
+ resource "aws_ssm_parameter" "cluster_version" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s/common/eks-demo-a/cluster_version"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.eks.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.aws_cloudwatch_log_group.cluster will be created
+ resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/eks/eks-demo-a-"
      + retention_in_days = 7
      + tags              = {
          + "Environment"                      = "demo"
          + "KubernetesCluster"                = "eks-demo-a"
          + "Name"                             = "eks-demo-a"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all          = {
          + "Environment"                      = "demo"
          + "KubernetesCluster"                = "eks-demo-a"
          + "Name"                             = "eks-demo-a"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
    }

  # module.eks.aws_eks_addon.coredns[0] will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name        = "coredns"
      + addon_version     = "v1.8.7-eksbuild.2"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.kube-proxy[0] will be created
+ resource "aws_eks_addon" "kube-proxy" {
      + addon_name        = "kube-proxy"
      + addon_version     = "v1.23.7-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.vpc-cni[0] will be created
+ resource "aws_eks_addon" "vpc-cni" {
      + addon_name        = "vpc-cni"
      + addon_version     = "v1.11.3-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_cluster.cluster will be created
+ resource "aws_eks_cluster" "cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-demo-a"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Name"        = "eks-demo-a"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Name"        = "eks-demo-a"
        }
      + version               = "1.23"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-01baefaafd9a5d53b",
              + "subnet-0a7db5a0fef954bb8",
              + "subnet-0e480aadf4a64c2bf",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-demo-a-worker"
      + path        = "/"
      + role        = "eks-demo-a-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be created
+ resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-demo-a-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.worker will be created
+ resource "aws_iam_role" "worker" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-demo-a-worker"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-demo-a-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-demo-a-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-demo-a-worker"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-demo-a-worker"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-demo-a-worker"
    }

  # module.eks.aws_security_group.cluster will be created
+ resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with Worker Nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-a-cluster"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-a-cluster"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-a-cluster"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + vpc_id                 = "vpc-0ba3703a78b7b8f5e"
    }

  # module.eks.aws_security_group.worker will be created
+ resource "aws_security_group" "worker" {
      + arn                    = (known after apply)
      + description            = "EKS worker node common security_group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-a-worker"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + vpc_id                 = "vpc-0ba3703a78b7b8f5e"
    }

  # module.eks.aws_security_group_rule.cluster_vpn will be created
+ resource "aws_security_group_rule" "cluster_vpn" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow vpn to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_worker will be created
+ resource "aws_security_group_rule" "cluster_worker" {
      + description              = "Allow workers to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster will be created
+ resource "aws_security_group_rule" "worker_cluster" {
      + description              = "Allow to communicate between master and workers (eks-demo-a-worker)"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_10250 will be created
+ resource "aws_security_group_rule" "worker_cluster_10250" {
      + description              = "Allow to communicate between master and workers (eks-demo-a-worker)"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_443 will be created
+ resource "aws_security_group_rule" "worker_cluster_443" {
      + description              = "Allow to communicate between master and workers (eks-demo-a-worker)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_source[0] will be created
+ resource "aws_security_group_rule" "worker_source" {
      + description              = "Allow to communicate between source and workers (eks-demo-a-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-02c7deaf03238d6a3"
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_ssh will be created
+ resource "aws_security_group_rule" "worker_ssh" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow to communicate between ssh and workers (eks-demo-a-worker)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_worker will be created
+ resource "aws_security_group_rule" "worker_worker" {
      + description              = "Allow to communicate between workers (eks-demo-a-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_sqs_queue.worker will be created
+ resource "aws_sqs_queue" "worker" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "eks-demo-a-worker"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "events.amazonaws.com",
                              + "sqs.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-a-worker"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + tags_all                          = {
          + "Name"                             = "eks-demo-a-worker"
          + "kubernetes.io/cluster/eks-demo-a" = "owned"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.eks.kubernetes_config_map.aws_auth will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::082867736673:role/eks-demo-a-worker"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/atlantis-ecs_task_execution"
                  "username": "atlantis-ecs"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/irsa--eks-demo--atlantis"
                  "username": "atlantis-eks"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-master"
                  "username": "k8s-master"
                - "groups": []
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-readonly"
                  "username": "k8s-readonly"
            EOT
          + "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/ops"
                  "username": "iam-user-ops"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/bruce"
                  "username": "iam-user-bruce"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/jungyoul.yu"
                  "username": "iam-user-jungyoul.yu"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-ebs-csi-driver:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-ebs-csi-driver policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-ebs-csi-driver"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateSnapshot",
                          + "ec2:AttachVolume",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-ebs-csi-driver"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-ebs-csi-driver"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-ebs-csi-driver"
    }

  # module.irsa["aws-ebs-csi-driver-sa"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-ebs-csi-driver-sa"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-ebs-csi-driver-sa policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-ebs-csi-driver-sa"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateSnapshot",
                          + "ec2:AttachVolume",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-ebs-csi-driver-sa"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-ebs-csi-driver-sa"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-ebs-csi-driver-sa"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-ebs-csi-driver-sa"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver-sa"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-ebs-csi-driver-sa"
    }

  # module.irsa["aws-efs-csi-driver"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-efs-csi-driver:efs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-efs-csi-driver policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-efs-csi-driver"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeAccessPoints",
                          + "elasticfilesystem:DescribeFileSystems",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticfilesystem:CreateAccessPoint",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "elasticfilesystem:DeleteAccessPoint"
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-efs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-efs-csi-driver"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-efs-csi-driver"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-efs-csi-driver"
    }

  # module.irsa["aws-load-balancer-controller"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-load-balancer-controller:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-load-balancer-controller policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-load-balancer-controller"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-load-balancer-controller"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-load-balancer-controller"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-load-balancer-controller"
    }

  # module.irsa["aws-node"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-node"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--aws-node policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--aws-node"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AssignIpv6Addresses",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstanceTypes",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:network-interface/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-node"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--aws-node"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--aws-node"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--aws-node"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-node"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--aws-node"
    }

  # module.irsa["aws-node-termination-handler"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.